{
  "meta": {
    "releasedOn": "2022.xx.xx"
  },

  "Added": [
    {
      "what": [
        "additional checkbox: `Hide sidebar on namespace public pages`, when creating/editing a compose namespace.",
        "By default, the checkbox is not checked, disabled, and the sidebar is enabled.",
        "Enabling the checkbox means that the sidebar get hidden on all namespace public pages."
      ],
      "why": [
        "because we wanted to provide the user with the ability to whether enable or disable the sidebar across the public pages."
      ],
      "refs": [
        "https://github.com/cortezaproject/corteza/commit/41ed9ed6ba8ab474cca7a512f04601ebf0ee4ecd"
      ]
    },
    {
      "what": [
        "support for page duplication.",
        "A page can be duplicated when in edit mode or when in the page builder view."
      ],
      "why": [
        "because this easily allows users to copy/share content from one page to another."
      ],
      "refs": [
        "https://github.com/cortezaproject/corteza-webapp-compose/pull/450/commits/9ea064c57552bb3c173302d6a4111e3889f92115",
        "https://github.com/cortezaproject/corteza-locale/commit/47e06ebb251d87f3ff058e3a42dc7b26ef425ad5"
      ]
    },
    {
      "what": [
        "auto-refreshing and manual refreshing feature to page blocks excluding, Content, Record and File Blocks.",
        "An icon now appears on blocks when you enable the refresh feature.",
        "That icon is clickable even though refresh will happen automatically based on the duration you have set."
      ],
      "why": [
        "because users do not have to refresh the entire page to see new content on blocks."
      ],
      "refs": [
        "https://github.com/cortezaproject/corteza-js/pull/73/commits/1a77d99e54697f1bbe29622688996dc05a8c06c4"
      ]
    }
  ],

  "changed": [
    {
      "what": [
        "the integration gateway route search filtering in administration area was not returning any result if the whole name was not entered."
      ],
      "why": [
        "because you need to be able to search endpoints with partial endpoint values."
      ],
      "how": [
        "by fixing the way filtering works on integration routes search."
      ],
      "refs": [
        "https://github.com/cortezaproject/corteza-server/commit/e551b735be59229bfdadba11ab7ae7ab525f84af"
      ]
    },
    {
      "what": [
        "the requirement to provide a handle when creating a resource is removed.",
        "This is now optional.",
        "The change is applied in corteza-webapp-compose, corteza-webapp-admin, corteza-webapp-reporter and corteza-webapp-workflow"
      ],
      "why": [
        "because providing a handle shouldn't be a necessity.",
        "The resource can be created without it."
      ],
      "how": [
        "by removing the requirement for the handle to be provided."
      ],
      "refs": [
        "https://github.com/cortezaproject/corteza-webapp-compose/commit/cd86e854b76866eeb67d33753b1b736be0d1957a", 
        "https://github.com/cortezaproject/corteza-webapp-reporter/commit/cf21c47c17c1b76eefc461543236abdf04277cb0", 
        "https://github.com/cortezaproject/corteza-webapp-admin/commit/456c896adaa7e3423c81d05a541f044b5acc9cc8", 
        "https://github.com/cortezaproject/corteza-webapp-workflow/commit/9b88af07260977ea744cce8ff7f54185ad9bd5d3", 
        "https://github.com/cortezaproject/corteza-locale/commit/24b0dda5d434b8f8f0df55d98d6695171533d81c", 
        "https://github.com/cortezaproject/corteza-vue/commit/34f261acc5297654eb372b8e804a7fd37e7b0d0e", 
        "https://github.com/cortezaproject/corteza-js/commit/3a90a1002074e31017b2ae22e5d74404283ea3e2" 
      ]
    },
    {
      "what": [
        "the deleted status on apigw route update gets preserved.",
        "Previously if you edited a deleted route, the route got restored, now this is improved."
      ],
      "why": [
        "Apigw route needed to handle deleted status on update in consistency with other subsystems (ie applications, users, ...)."
      ],
      "how": [
        "by changing the part of apigw service that handles route updates."
      ],
      "refs": [
        "https://github.com/cortezaproject/corteza/commit/16257e9d4b49dea0038a9ddb4372b5f3ec949915"
      ]
    },
    {
      "what": [
        "the color of the button for confirming the action to accept a privacy request."
      ],
      "why": [
        "This was done to match the same color pattern as the colors when confirming/denying the action to reject a privacy request.",
        "This also improves consistency and UX."
      ],
      "how": [
        "by changing the color to dark blue."
      ],
      "refs": [
        "https://github.com/cortezaproject/corteza/commit/8379518"
      ]
    },
    {
      "what": [
        "the module dal settings Record ID field was prevented from being able to be disabled.",
        "The unavailable badge added to system fields that are unchecked/unavailable from system field mapping and encoding is also changed.",
        "In system field mapping and encoding, a 5 buttons grouped together are added to enable/disable system fields."
      ],
      "why": [
        "To prevent users from disabling Record ID field on system field mapping and encoding.",
        "Unavailable feilds unchecked give users access to view system fields that are not available.",
        "Also this was changed to give users easy access to enable/disable system fields based on the button options provided."
      ],
      "how": [
        "By updating system field mapping logic to prevent Record ID from being disabled, this also applies to backend.",
        "System view configurator with the unavailable badge was also updated.",
        "Updated module dal settings to display button groups, with the logic to enable/disable fields that are related to a button"
      ],
      "refs": [
        "https://github.com/cortezaproject/corteza/pull/523/commits/07d41dcd8c1f40abf17f90868953eeb3603e0809" 
      ]
    },
    {
      "what": [
        "new page block type for Geometry",
        "Geometry page block renders a map within the rendering constraint from the Geometry configurator with points/markers and polygons.",
        "Geometry configurator loads data from the configured feed sources."
      ],
      "why": [
        "user can now configure a feed source for the Geometry which then loads the data in the record page, which is now rendered in markers and polygons."
      ],
      "how": [
        "by creating a new Geometry page block in js/compose.",
        "By adding the logic to configure the feed source for the Geometry.",
        "Also by loading the data from the configured feeds, which is then convert to display the markers and polygons on the map."
      ],
      "refs": [
        "https://github.com/cortezaproject/corteza/pull/538/commits/82249fa67ea5d31656001d9f358d6e6abf5539a2" 
      ]
    },
    {
      "what": [
        "new features to module Field configuration for styling image (fix height, fix width, rounded corners, border radius, background color, margin).",
        "The applied style changes in module field setting now reflect on only file with single image and gallery mode selected as the view mode when viewing record page or record list page."
      ],
      "why": [
        "to provide the user with more customization and styling option on viewing images."
      ],
      "how": [
        "by updating File module field on corteza-js to accept the styling properties.",
        "By updating List loader component with new styling properties for files with single and gallery mode.",
        "By updating File page block on corteza-js to accept the styling properties."
      ],
      "refs": [
        "https://github.com/cortezaproject/corteza/pull/533/commits/ccd90d74d4945e96d21281c68bfe9f18bc394844"
      ]
    },
    {
      "what": [
        ""
      ],
      "why": [
        ""
      ],
      "how": [
        ""
      ],
      "refs": [
        ""
      ]
    }
  ],

  "fixed": [
    {
      "what": [
        "report request crash when using dup. attr idents",
        "When request to /report endpoint with multiple attributes using the same ident was used, request crashed with an error that Scan expects N+M destinations but got N."
      ],
      "how": [
        "by fixing the way scan destination slice was constructed, using column ident as unique key.",
        "This was problem only for aggregations.",
        "This is now done only for attributes with store type SimpleJsonDocColumn."
      ],
      "refs": [
        "https://github.com/cortezaproject/corteza/commit/88bafc2f15df0d1246130344c319df419008a063"
      ]
    }
  ]
}
